# Normalization

### is used to scale the data of an attribute so that it falls in a smaller range, such as -1.0 to 1.0 or 0.0 to 1.0.

# Decimal scaling method for normalization

In [15]:
input = [-10, 201, 301, -401, 501, 601, 701]

##### step1: find the maximum absolute value in given data

In [16]:
for i in input:
    x = abs(i)
    print(x)

10
201
301
401
501
601
701

In [17]:
maxi = 701

##### step2: divide the data by 10 th to the power of j

In [18]:
j = 3

divisor = 10 ** j

In [19]:
divisor

1000

##### step3: apply the formula

In [20]:
normalized_data = []

for i in input:
    x = i / divisor
    normalized_data.append(x)
print(normalized_data)

[-0.01, 0.201, 0.301, -0.401, 0.501, 0.601, 0.701]

# min-max normalization

In [21]:
import pandas as pd

In [22]:
df = pd.read_csv("./Soccer_players_data1.csv")

In [23]:
df

,Second name,First name,Gender,Height(cm),Weight(kg),Country/Team
0,Abbadi,Ilyas,M,170,69,Algeria
1,Abbate,Simona,W,171,64,Italy
2,Abdelaal,Hesham,M,167,52,Egypt
3,Abdulrahman,Amer,M,168,68,United Arab Emirates
4,Abian,Pablo,M,177,78,Spain
...,...,...,...,...,...,...
1582,Zhou,Peng,M,183,88,China
1583,Zlokovic,Boris,M,197,100,Montenegro
1584,Zolnir,Urska,W,173,63,Slovenia
1585,Zoric,Milenko,M,179,73,Serbia
1586,Zugaj,Nenad,M,177,84,Croatia

In [24]:
df.columns

Index(['Second name', 'First name', 'Gender', 'Height(cm)', 'Weight(kg)',
       'Country/Team'],
      dtype='object')

In [25]:
df["Weight(kg)"] * 3

0       207
1       192
2       156
3       204
4       234
       ...
1582    264
1583    300
1584    189
1585    219
1586    252
Name: Weight(kg), Length: 1587, dtype: int64

In [26]:
# perform min-max scaling on a specific column
column_name = 'Weight(kg)'

df["Weight(kg)_normalized"] = (df["Weight(kg)"] - df["Weight(kg)"].min()) / (df["Weight(kg)"].max() -df["Weight(kg)"].min())

In [27]:
# perform min-max scaling on a specific column
column_name = 'Height(cm)'

df["Height(cm)_normalized"] = (df["Height(cm)"] - df["Height(cm)"].min()) / (df["Height(cm)"].max() -df["Height(cm)"].min())

In [28]:
df

,Second name,First name,Gender,Height(cm),Weight(kg),Country/Team,Weight(kg)_normalized,Height(cm)_normalized
0,Abbadi,Ilyas,M,170,69,Algeria,0.207447,0.409639
1,Abbate,Simona,W,171,64,Italy,0.180851,0.421687
2,Abdelaal,Hesham,M,167,52,Egypt,0.117021,0.373494
3,Abdulrahman,Amer,M,168,68,United Arab Emirates,0.202128,0.385542
4,Abian,Pablo,M,177,78,Spain,0.255319,0.493976
...,...,...,...,...,...,...,...,...
1582,Zhou,Peng,M,183,88,China,0.308511,0.566265
1583,Zlokovic,Boris,M,197,100,Montenegro,0.372340,0.734940
1584,Zolnir,Urska,W,173,63,Slovenia,0.175532,0.445783
1585,Zoric,Milenko,M,179,73,Serbia,0.228723,0.518072
1586,Zugaj,Nenad,M,177,84,Croatia,0.287234,0.493976

In [29]:
# perform min-max scaling on a specific column
column_name = 'Height(cm)'

df["Height(cm)_normalized"] = (df["Height(cm)"] - df["Height(cm)"].min()) / (df["Height(cm)"].max() -df["Height(cm)"].min())

In [30]:
df

,Second name,First name,Gender,Height(cm),Weight(kg),Country/Team,Weight(kg)_normalized,Height(cm)_normalized
0,Abbadi,Ilyas,M,170,69,Algeria,0.207447,0.409639
1,Abbate,Simona,W,171,64,Italy,0.180851,0.421687
2,Abdelaal,Hesham,M,167,52,Egypt,0.117021,0.373494
3,Abdulrahman,Amer,M,168,68,United Arab Emirates,0.202128,0.385542
4,Abian,Pablo,M,177,78,Spain,0.255319,0.493976
...,...,...,...,...,...,...,...,...
1582,Zhou,Peng,M,183,88,China,0.308511,0.566265
1583,Zlokovic,Boris,M,197,100,Montenegro,0.372340,0.734940
1584,Zolnir,Urska,W,173,63,Slovenia,0.175532,0.445783
1585,Zoric,Milenko,M,179,73,Serbia,0.228723,0.518072
1586,Zugaj,Nenad,M,177,84,Croatia,0.287234,0.493976

In [31]:
import pandas as pd

In [32]:
from sklearn.preprocessing import MinMaxScaler

In [33]:
cust = pd.read_csv("./customer_shopping_data.csv")

In [36]:
cust

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,05-08-2022,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12-12-2021,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,09-11-2021,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16-05-2021,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24-10-2021,Kanyon
...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,Souvenir,5,58.65,Credit Card,21-09-2022,Kanyon
99453,I325143,C569580,Male,27,Food & Beverage,2,10.46,Cash,22-09-2021,Forum Istanbul
99454,I824010,C103292,Male,63,Food & Beverage,2,10.46,Debit Card,28-03-2021,Metrocity
99455,I702964,C800631,Male,56,Technology,4,4200.00,Cash,16-03-2021,Istinye Park
99456,I232867,C273973,Female,36,Souvenir,3,35.19,Credit Card,15-10-2022,Mall of Istanbul

In [40]:
df = pd.DataFrame({"A": [1, 2, 3, 4, 5], "B": [76, 74545, 98, 9777, 87810]})
# perform min-max normalization on columns price
scaler = MinMaxScaler()
normalized_df = scaler.fit_transform(df)
normalized_df = pd.DataFrame(normalized_df, columns=df.columns)

print(normalized_df)

sklearn.preprocessing._data.MinMaxScaler

In [54]:
class LinearRegr():
    
    def __init__(self):
        pass
            
    def fit(self, x, y):
        y = x ** 2

In [59]:
lr = LinearRegr()
type(lr)
train = lr.fit(1, 3)
print(train)

None

In [44]:
import numpy as np

x = np.array([1, 2, 3])
type(x)

# object will have attributes and methods

numpy.ndarray

In [45]:
x.shape

(3,)

In [46]:
x.ndim

1

In [47]:
x.size

3

In [48]:
x.mean()

2.0

In [38]:
cust.columns

Index(['invoice_no', 'customer_id', 'gender', 'age', 'category', 'quantity',
       'price', 'payment_method', 'invoice_date', 'shopping_mall'],
      dtype='object')

# Z-score normalization

In [32]:
cust.tail()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
99452,I219422,C441542,Female,45,Souvenir,5,58.65,Credit Card,21-09-2022,Kanyon
99453,I325143,C569580,Male,27,Food & Beverage,2,10.46,Cash,22-09-2021,Forum Istanbul
99454,I824010,C103292,Male,63,Food & Beverage,2,10.46,Debit Card,28-03-2021,Metrocity
99455,I702964,C800631,Male,56,Technology,4,4200.00,Cash,16-03-2021,Istinye Park
99456,I232867,C273973,Female,36,Souvenir,3,35.19,Credit Card,15-10-2022,Mall of Istanbul

In [61]:
type(cust)

pandas.core.frame.DataFrame

In [66]:
cust.describe()

                age      quantity         price
count  99457.000000  99457.000000  99457.000000
mean      43.427089      3.003429    689.256321
std       14.990054      1.413025    941.184567
min       18.000000      1.000000      5.230000
25%       30.000000      2.000000     45.450000
50%       43.000000      3.000000    203.300000
75%       56.000000      4.000000   1200.320000
max       69.000000      5.000000   5250.000000

In [37]:
# perform z-score normalization on a specific column

column_name = 'price'

mean_value = cust["price"].mean()
std_value = cust["price"].std()

cust["price_normalized"] = (cust["price"] - mean_value) / std_value

In [38]:
mean_value

689.2563209226097

In [39]:
std_value

941.184567215467

In [40]:
cust

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall,price_normalized
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,05-08-2022,Kanyon,0.861833
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12-12-2021,Forum Istanbul,1.180697
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,09-11-2021,Metrocity,-0.413496
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16-05-2021,Metropol AVM,2.456047
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24-10-2021,Kanyon,-0.667942
...,...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,Souvenir,5,58.65,Credit Card,21-09-2022,Kanyon,-0.670013
99453,I325143,C569580,Male,27,Food & Beverage,2,10.46,Cash,22-09-2021,Forum Istanbul,-0.721215
99454,I824010,C103292,Male,63,Food & Beverage,2,10.46,Debit Card,28-03-2021,Metrocity,-0.721215
99455,I702964,C800631,Male,56,Technology,4,4200.00,Cash,16-03-2021,Istinye Park,3.730133
99456,I232867,C273973,Female,36,Souvenir,3,35.19,Credit Card,15-10-2022,Mall of Istanbul,-0.694939

In [67]:
# perform z-score normalization on a specific column

column_name = 'age'

mean_value = cust["age"].mean()
std_value = cust["age"].std()

cust["age_normalized"] = (cust["age"] - mean_value) / std_value

In [42]:
cust

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall,price_normalized,age_normalized
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,05-08-2022,Kanyon,0.861833,-1.029155
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12-12-2021,Forum Istanbul,1.180697,-1.496131
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,09-11-2021,Metrocity,-0.413496,-1.562842
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16-05-2021,Metropol AVM,2.456047,1.505859
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24-10-2021,Kanyon,-0.667942,0.638618
...,...,...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,Souvenir,5,58.65,Credit Card,21-09-2022,Kanyon,-0.670013,0.104930
99453,I325143,C569580,Male,27,Food & Beverage,2,10.46,Cash,22-09-2021,Forum Istanbul,-0.721215,-1.095866
99454,I824010,C103292,Male,63,Food & Beverage,2,10.46,Debit Card,28-03-2021,Metrocity,-0.721215,1.305727
99455,I702964,C800631,Male,56,Technology,4,4200.00,Cash,16-03-2021,Istinye Park,3.730133,0.838750
99456,I232867,C273973,Female,36,Souvenir,3,35.19,Credit Card,15-10-2022,Mall of Istanbul,-0.694939,-0.495468

In [43]:
std_value

14.990053791852413

In [44]:
from sklearn.preprocessing import StandardScaler

In [45]:
df

   A      B
0  1     76
1  2  74545
2  3     98
3  4   9777
4  5  87810

In [52]:
players = pd.read_csv("./Soccer_players_data1.csv")
dfp = players[["Height(cm)", "Weight(kg)"]]
dfp

      Height(cm)  Weight(kg)
0            170          69
1            171          64
2            167          52
3            168          68
4            177          78
...          ...         ...
1582         183          88
1583         197         100
1584         173          63
1585         179          73
1586         177          84

[1587 rows x 2 columns]

In [54]:
# perform z-score transformation on columns A and B
scaler = StandardScaler()
z_score_df = scaler.fit_transform(df)

z_score_df = pd.DataFrame(z_score_df, columns=df.columns)

print(z_score_df)

          A         B
0 -1.414214 -0.892278
1 -0.707107  1.040153
2  0.000000 -0.891707
3  0.707107 -0.640542
4  1.414214  1.384373

In [55]:
df["A"].mean()

3.0

In [56]:
df["A"].std()

1.5811388300841898

# standardization

### Why is data Standardization important?

##### Standardization also makes it easier to process and analyze data and store it int a database

### How to Standardize data?

##### z-score method

##### z-score = summation_of(individual_datapoint - mean of data set) / standard deviation of data set

In [57]:
units = pd.read_csv("./unit _sales_data.csv")

In [58]:
units

    Month  Unit Sales  Price ($)  Adexp ('000$)  Promexp ('000$)
0     1.0     73959.0       8.75          50.04            61.13
1     2.0     71544.0       8.99          50.74            60.19
2     3.0     78587.0       7.50          50.14            59.16
3     4.0     80364.0       7.25          50.27            60.38
4     5.0     78771.0       7.40          51.25            59.71
5     6.0     71986.0       8.50          50.65            59.88
6     7.0     74885.0       8.40          50.87            60.14
7     8.0     73345.0       7.90          50.15            60.08
8     9.0     76659.0       7.25          48.24            59.90
9    10.0     71880.0       8.70          50.19            59.68
10   11.0     73598.0       8.40          51.11            59.83
11   12.0     74893.0       8.10          51.49            59.77
12   13.0     69003.0       8.40          50.10            59.29
13   14.0     78542.0       7.40          49.24            60.40
14   15.0     72543.0       8.00          50.04            59.89
15   16.0     74247.0       8.30          49.46            60.06
16   17.0     76253.0       8.10          51.62            60.51
17   18.0     72582.0       8.20          49.78            58.93
18   19.0     69022.0       8.99          48.60            60.09
19   20.0     76200.0       7.99          49.00            61.00
20   21.0     69701.0       8.50          48.00            59.00
21   22.0     77005.0       7.90          54.00            59.50
22   23.0     70987.0       7.99          48.70            58.00
23   24.0     75643.0       8.25          50.00            60.50
24    NaN         NaN        NaN            NaN              NaN
25    NaN         NaN        NaN            NaN              NaN
26    NaN         NaN        NaN            NaN              NaN
27    NaN         NaN        NaN            NaN              NaN

In [63]:
# perform z-score transformation on columns A and B
scaler = StandardScaler()
z_score_units = scaler.fit_transform(units)

z_score_units = pd.DataFrame(z_score_units, columns=units.columns)

x = z_score_units.dropna()

print(x)

       Month  Unit Sales  Price ($)  Adexp ('000$)  Promexp ('000$)
0  -1.661325   -0.096615   1.246645      -0.090508         1.877915
1  -1.516862   -0.876209   1.730518       0.468514         0.470415
2  -1.372399    1.397363  -1.273527      -0.010648        -1.071847
3  -1.227936    1.971002  -1.777561       0.093170         0.754909
4  -1.083473    1.456761  -1.475141       0.875801        -0.248309
5  -0.939010   -0.733525   0.742611       0.396639         0.006239
6  -0.794547    0.202310   0.540997       0.572332         0.395548
7  -0.650084   -0.294822  -0.467072      -0.002662         0.305707
8  -0.505621    0.774980  -1.777561      -1.527993         0.036186
9  -0.361158   -0.767744   1.145838       0.029282        -0.293229
10 -0.216695   -0.213151   0.540997       0.763997        -0.068628
11 -0.072232    0.204892  -0.063844       1.067466        -0.158469
12  0.072232   -1.696477   0.540997      -0.042592        -0.877192
13  0.216695    1.382837  -1.475141      -0.729391         0.784856
14  0.361158   -0.553719  -0.265458      -0.090508         0.021212
15  0.505621   -0.003645   0.339383      -0.553698         0.275760
16  0.650084    0.643918  -0.063844       1.171284         0.949564
17  0.794547   -0.541129   0.137769      -0.298145        -1.416235
18  0.939010   -1.690343   1.730518      -1.240496         0.320681
19  1.083473    0.626809  -0.285620      -0.921055         1.683261
20  1.227936   -1.471153   0.742611      -1.719658        -1.311421
21  1.372399    0.886673  -0.467072       3.071959        -0.562751
22  1.516862   -1.056016  -0.285620      -1.160636        -2.808762
23  1.661325    0.447002   0.238576      -0.122452         0.934590

In [64]:
units["Month"].std()

7.0710678118654755

In [ ]:
Standardization: if you need to compare data from different sources
normalization: if you want to ensure all your data is in the same format, then data normalization my be the better choice

# Log Transformation

In [ ]:
log_base(x) = y,

In [ ]:
x = base ** y

In [ ]:
base 2 
base 10 
base e = 2.718282 ==> natural log

In [69]:
import math

In [71]:
math.log2(24)

4.584962500721156

In [71]:
math.log2(8)

3.0

In [ ]:
sqrt(8)

In [73]:
math.log2(16)

4.0

In [72]:
math.log10(1000)

3.0

In [74]:
math.log(3.14)

1.144222799920162

In [74]:
math.log10(100)

2.0

In [ ]:
10(rt(100))

In [76]:
math.log(7.839)

2.059111275206585

In [75]:
2.718282 * 2.718282

7.389057031524

In [77]:
import numpy as np

In [78]:
x = [1, 2, 3, 4, 5]

In [79]:
y = np.log(x)

In [80]:
y

array([0.        , 0.69314718, 1.09861229, 1.38629436, 1.60943791])

In [81]:
import matplotlib.pyplot as plt

In [85]:
# create a sample DataFrame with exponenential data
df = pd.DataFrame({"A": [1, 10, 100, 1000], "B": [0.1, 1, 10, 100]})

In [77]:
# perform log transformation on columns A and B
log_transformed_df = np.log(df)

In [78]:
print(log_transformed_df)

          A          B
0  0.000000   4.330733
1  0.693147  11.219158
2  1.098612   4.584967
3  1.386294   9.187788
4  1.609438  11.382931